# Используем базовый образ с Node.js и npm
FROM node:16-alpine

# Устанавливаем директорию для приложения
WORKDIR /app

# Копируем файлы приложения в директорию приложения
COPY package*.json ./

# Устанавливаем зависимости приложения
RUN npm install --production

# Копируем все файлы проекта в директорию /app
COPY . .

# Собираем приложение
RUN npm run build --production

# Задаем порт, который будет использоваться для доступа к приложению
EXPOSE 3000

# Запускаем приложение
CMD ["npm", "start"]